---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSetting.CurrentViewSheetSet
source: html/e0e891ee-2ff1-9097-9faa-6e3c7db51e81.htm
---
# Autodesk.Revit.DB.ViewSheetSetting.CurrentViewSheetSet Property

The current view sheet set of PrintSetup.

## Syntax (C#)
```csharp
public IViewSheetSet CurrentViewSheetSet { get; set; }
```